# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [1]:
import pandas as pd
df_data=pd.read_csv("Purchase_Data.csv",header=0)
df_data.head()

FileNotFoundError: [Errno 2] No such file or directory: 'Purchase_Data.csv'

Use the dtypes attribute to view how each column is stored

In [ ]:
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [ ]:
result_1=df_data.loc[0:1,:]
result_1

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0

Slice the first two rows using .loc and store the result in a variable called result_2.

In [ ]:
result_2=df_data.loc[0:3,]

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [ ]:
result_3=df_data.loc[df_data.index[:4],df_data.columns[:5]]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [ ]:
result_4=df_data.loc[[0,4,6],["invoice_time","price"]]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [ ]:
num_rows = df_data.shape[0]
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [ ]:
last_row = df_data.loc[[num_rows - 1],:]
last_row

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [ ]:
avg_price_charged = df_data["price"].mean()
max_price_charged = df_data['price'].max()
avg_price_charged,max_price_charged

(np.float64(3.1920522110741363), np.float64(6.01))

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [ ]:
means = df_data[["price","num_item"]].mean()
avg_price = means["price"]
avg_num_items = means["num_item"]
avg_price,avg_num_items

(np.float64(3.1920522110741363), np.float64(1.2983091787439613))

Create a column called "total", which is the product of the price and num_item columns.

In [ ]:
df_data["total"]=df_data["price"]*df_data["num_item"]
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [ ]:
avg_most_3expensive = df_data["price"].nlargest(3).mean()
avg_most_3expensive

np.float64(6.003333333333333)

How many different products are there?

In [ ]:
num_products = df_data["product_id"].nunique()
num_products

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [ ]:
desc = df_data["total"].describe()
diff_mean_median = desc["mean"]-desc["50%"]
diff_mean_median

np.float64(0.9318078781127839)

Use the drop() method to delete the column total from the dataframe df_data.

In [ ]:
df_data = df_data.drop(columns=["total"])
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [ ]:
df_data.info()
df_data.head()
df_data.describe(include="all")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5382 entries, 0 to 5381
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_number  5382 non-null   float64
 1   invoice_time    5382 non-null   object
 2   store_id        5382 non-null   object
 3   product_id      5382 non-null   int64
 4   category_id     5382 non-null   int64
 5   num_item        5382 non-null   float64
 6   price           5382 non-null   float64
dtypes: float64(3), int64(2), object(2)
memory usage: 294.5+ KB

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
count,5.382000e+03,5382,5382,5.382000e+03,5382.000000,5382.000000,5382.000000
unique,NaN,3502,5,NaN,NaN,NaN,NaN
top,NaN,9/4/15 23:31,G816,NaN,NaN,NaN,NaN
freq,NaN,14,2076,NaN,NaN,NaN,NaN
mean,2.020000e+11,NaN,NaN,8.740911e+06,115465.616499,1.298309,3.192052
std,0.000000e+00,NaN,NaN,5.048294e+06,65448.435316,2.168725,1.652007
min,2.020000e+11,NaN,NaN,7.000034e+06,70101.000000,0.500000,0.000000
25%,2.020000e+11,NaN,NaN,7.070884e+06,70201.000000,1.000000,2.000000
50%,2.020000e+11,NaN,NaN,7.071096e+06,70401.000000,1.000000,2.500000
75%,2.020000e+11,NaN,NaN,7.090592e+06,210101.000000,1.000000,5.000000
max,2.020000e+11,NaN,NaN,3.000077e+07,210301.000000,116.000000,6.010000

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [ ]:
df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])
df_data.dtypes

C:\Users\User\AppData\Local\Temp\ipykernel_8072\3912320394.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data["invoice_time"] = pd.to_datetime(df_data["invoice_time"])

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [ ]:
df_data["DOW"]=df_data["invoice_time"].dt.day_name()
df_data["Month"]=df_data["invoice_time"].dt.month_name()
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,DOW,Month
0,2.020000e+11,2015-07-15 10:45:00,G816,7000300,210101,1.0,2.0,Wednesday,July
1,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
2,2.020000e+11,2015-07-15 12:16:00,G816,7070884,70203,1.0,2.0,Wednesday,July
3,2.020000e+11,2015-07-15 12:16:00,G816,7070891,70401,1.0,6.0,Wednesday,July
4,2.020000e+11,2015-07-15 12:16:00,G816,7090363,70401,1.0,6.0,Wednesday,July

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [ ]:
num_purchase_wed = df_data["DOW"].value_counts().loc["Wednesday"]
num_purchase_wed

np.int64(959)

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [ ]:
df_titanic = pd.read_csv("Titanic.csv")
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [ ]:
df_titanic = df_titanic.rename(columns={"Name":"Passenger_Name","Ticket":"Ticket_Num"})
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [ ]:
df_titanic=df_titanic.set_index("PassengerId")
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [ ]:
passenger_896_name = df_titanic.loc[896, "Passenger_Name"]
passenger_896_name

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [ ]:
df_titanic=df_titanic.reset_index()
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [ ]:
num_missing_age = df_titanic["Age"].isnull().sum()
num_missing_age

np.int64(86)

Compute the avg age of passengers ignoring the missing data.

In [ ]:
avg_age = df_titanic["Age"].mean()
avg_age

np.float64(30.272590361445783)

Using the fillna() method replace the missing values in the Age column with the mean.

In [ ]:
mean_age = df_titanic["Age"].mean()
df_titanic["Age"] =df_titanic["Age"].fillna(mean_age)
df_titanic["Age"].isnull().sum()

np.int64(0)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [ ]:

avg_age_5_oldest = df_titanic.reset_index().nlargest(5,"Age")["Age"].mean()
avg_age_5_oldest

np.float64(67.0)